package com.example.myapplication;

import android.os.Bundle;

import androidx.activity.EdgeToEdge;
import androidx.appcompat.app.AppCompatActivity;
import androidx.core.graphics.Insets;
import androidx.core.view.ViewCompat;
import androidx.core.view.WindowInsetsCompat;
import android.view.View;
import android.hardware.ConsumerIrManager;

public class MainActivity extends AppCompatActivity {
    ConsumerIrManager IR;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        EdgeToEdge.enable(this);
        setContentView(R.layout.activity_main);
        ViewCompat.setOnApplyWindowInsetsListener(findViewById(R.id.main), (v, insets) -> {
            Insets systemBars = insets.getInsets(WindowInsetsCompat.Type.systemBars());
            v.setPadding(systemBars.left, systemBars.top, systemBars.right, systemBars.bottom);
            return insets;
        });
        IR = (ConsumerIrManager) getSystemService(CONSUMER_IR_SERVICE);
    }
    public void button1Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X00
                560,565, 560,565, 560,565, 560,565, 560,565, 560,565, 560,565, 560,565,
// 下面一行表示数据反码：0XFF
                560,1690, 560,1690, 560,1690, 560,1690, 560,1690, 560,1690, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }
    public void button2Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X01
                560,1690, 560,565, 560,565, 560,565, 560,565, 560,565, 560,565, 560,565,
// 下面一行表示数据反码：0XFE
                560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,1690, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }
    public void button3Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X02
                560,560, 560,1690, 560,565, 560,565, 560,565, 560,565, 560,560, 560,565,
// 下面一行表示数据反码：0XFD
                560,1690, 560,560, 560,1690, 560,1690, 560,1690, 560,1690, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }
    public void button4Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X03
                560,1690, 560,1690, 560,565, 560,565, 560,565, 560,565, 560,560, 560,565,
// 下面一行表示数据反码：0XFC
                560,565, 560,560, 560,1690, 560,1690, 560,1690, 560,1690, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }
    public void button5Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X04
                560,560, 560,565, 560,1690, 560,565, 560,565, 560,565, 560,560, 560,565,
// 下面一行表示数据反码：0XFB
                560,1690, 560,1690, 560,560, 560,1690, 560,1690, 560,1690, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }
    public void button6Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X05
                560,1690, 560,565, 560,1690, 560,565, 560,565, 560,565, 560,560, 560,565,
// 下面一行表示数据反码：0XFA
                560,565, 560,1690, 560,560, 560,1690, 560,1690, 560,1690, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }
    public void button7Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X06
                560,565, 560,1690, 560,1690, 560,565, 560,565, 560,565, 560,565, 560,565,
// 下面一行表示数据反码：0XF9
                560,1690, 560,565, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }
    public void button8Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X07
                560,1690, 560,1690, 560,1690, 560,565, 560,565, 560,565, 560,565, 560,565,
// 下面一行表示数据反码：0XF8
                560,565, 560,565, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }
    public void button9Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X08
                560,565, 560,565, 560,565, 560,1690, 560,565, 560,565, 560,560, 560,565,
// 下面一行表示数据反码：0XF7
                560,1690, 560,1690, 560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }
    public void button10Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X09
                560,1690, 560,565, 560,565, 560,1690, 560,565, 560,565, 560,565, 560,565,
// 下面一行表示数据反码：0XF6
                560,565, 560,1690, 560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }
    public void button11Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X10
                560,565, 560,565, 560,565, 560,565, 560,1690, 560,565, 560,565, 560,565,
// 下面一行表示数据反码：0XEF
                560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }
    public void button12Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X11
                560,1690, 560,565, 560,565, 560,565, 560,1690, 560,565, 560,565, 560,565,
// 下面一行表示数据反码：0XEE
                560,565, 560,1690, 560,1690, 560,1690, 560,565, 560,1690, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }
    public void button13Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X12
                560,565, 560,1690, 560,565, 560,565, 560,1690, 560,565, 560,565, 560,565,
// 下面一行表示数据反码：0XED
                560,1690, 560,565, 560,1690, 560,1690, 560,565, 560,1690, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }
    public void button14Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X13
                560,1690, 560,1690, 560,565, 560,565, 560,1690, 560,565, 560,565, 560,565,
// 下面一行表示数据反码：0XEC
                560,565, 560,565, 560,1690, 560,1690, 560,565, 560,1690, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }
    public void button15Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X14
                560,565, 560,565, 560,1690, 560,565, 560,1690, 560,565, 560,565, 560,565,
// 下面一行表示数据反码：0XEB
                560,1690, 560,1690, 560,565, 560,1690, 560,565, 560,1690, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }
    public void button16Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X15
                560,1690, 560,565, 560,1690, 560,565, 560,1690, 560,565, 560,565, 560,565,
// 下面一行表示数据反码：0XEA
                560,565, 560,1690, 560,565, 560,1690, 560,565, 560,1690, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }
    public void button17Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X16
                560,565, 560,1690, 560,1690, 560,565, 560,1690, 560,565, 560,565, 560,565,
// 下面一行表示数据反码：0XE9
                560,1690, 560,565, 560,565, 560,1690, 560,565, 560,1690, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }
    public void button18Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X17
                560,1690, 560,1690, 560,1690, 560,565, 560,1690, 560,565, 560,565, 560,565,
// 下面一行表示数据反码：0XE8
                560,565, 560,565, 560,565, 560,1690, 560,565, 560,1690, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }
    public void button19Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X18
                560,565, 560,565, 560,565, 560,1690, 560,1690, 560,565, 560,565, 560,565,
// 下面一行表示数据反码：0XE7
                560,1690, 560,1690, 560,1690, 560,565, 560,565, 560,1690, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }
    public void button20Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X19
                560,1690, 560,565, 560,565, 560,1690, 560,1690, 560,565, 560,565, 560,565,
// 下面一行表示数据反码：0XE6
                560,565, 560,1690, 560,1690, 560,565, 560,560, 560,1690, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }
    public void button21Clicked(View source) {
        int[] patternForKey1 = {9000,4500, // 开头两个数字表示引导码
// 下面两行表示用户码： 00000000 10111101  0xBD00
                560,565, 560,565, 560,565, 560,560, 560,565, 560,565, 560,565, 560,565,
                560,1690, 560,565, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690,
// 下面一行表示数据码：0X20
                560,565, 560,565, 560,565, 560,565, 560,565, 560,1690, 560,565, 560,565,
// 下面一行表示数据反码：0XDF
                560,1690, 560,1690, 560,1690, 560,1690, 560,1690, 560,565, 560,1690, 560,1690,
                560,42400, 9000, 2250, 560,4000}; // 末尾两个数字表示结束码
        IR.transmit(38000, patternForKey1);
    }

}
